{
    "data": [
        "I went to buy some camouflage trousers the other day but I couldn't find any. GET IT!?",
        "Two antennas met on a roof, fell in love and got married. The ceremony wasn't much, but the reception was excellent. Get it? Reception? Antennas?",
        "Why did the chicken cross the road? To get to the other side! What do you mean you've heard it before?",
        "An apple walks into a bar and asks the bartender for a sandwich. The bartender says, \"Sorry, we don't serve food here!\"",
        "An apple walks into a bar and sees that the bartender has an iphone [INSERT PUNCHLINE HERE]",
        "An apple walks into a bar and he sees a pear and uhh *(flips through cue cards)*",
        "An apple walks into a bar and asks the bartender for a sandwich. The bartender happily obliges with the Apple's request.",
        "What did the buffalo say to his son when he left for college? BISON!!!!",
        "A man walks up to you and yells \"I'M A SCATMAN\" and then walks away",
        "You are confronted by your greatest and most tragic fear. It makes a funny fart sound hehehehe",
        "I create an extremely hillarious setup and then BOOM funny punchline.",
        "*(Ahem)* .... What is up with Airline food!",
        "An apple walks into a bar and asks for a random drink. The bartender picks apple cider.",
        "An apple walks into a bar and sees a beautiful pear. The apple buys the pear a drink and they begin talking to each other. The pear and the Apple have a lot in common. They talk about their favorite movies. The apple says its alltime favourite movie is the 2012 hit film Foodfight! starring Charlie Sheen and Hilary Duff. The pear extatically claims that's its favourite movie too. The apple invites the pear back to his place to watch it together. Several months later the pear is now living with the apple rent free. One day the apple comes home from work to find the pear sleeping with a grapefruit! The apple, torn with grief, feeds itself to a horse.",
        "An apple walks into a bar and yells \"AYYYYYYYY\" expecting people to say it back, but what followed was nothing more than akward silence.",
        "What do you get when you cross a mentally ill loner with a society that abandons him and treats him like trash!? I’ll tell you what you get! You get what you fucking deserve!",
        "A joke is a display of humour in which words are used within a specific and well-defined narrative structure to make people laugh and is usually not meant to be taken seriously. It takes the form of a story, usually with dialogue, and ends in a punch line.",
        "An apple walks into a bar. That's it. That's all he does.",
        "What's red and bad for your teeth? A brick!",
        "Hey do you know Joe? *(snickers)* JOE MAMA!!",
        "I went golfing with my friends the other day, but for some reason they still can't accept that I won! I had the most points!",
		"You know who else likes polishing people's rocks?"
    ]
}